<template lang='pug'>
  div
    div(is='sui-container')
      TopMenu(isTerms=true)
      h2.terms-title-style サービス利用規約
      p.preface-style この利用規約（以下，「本規約」といいます。）は，Montage運営者（以下，「運営者」といいます。）が「Montage」の名称で提供するすべてのウェブサイト、ソフトウェア、アプリケーション、プロダクト、ドキュメントその他一切の製品およびサービス（以下，「本サービス」といいます。）の利用条件を定めるものです。登録ユーザーの皆さま（以下，「ユーザー」といいます。）には，本規約に従って，本サービスをご利用いただきます。
      div(v-for="block in blocks")
        TermsBlock
          h3.terms-title-style(slot="terms-header") {{block.title}}
          ol.paragraph-style(slot="terms-column")
            span(v-for="column in block.columns")
              ul.column-list-style(v-if="typeof(column) === 'object'")
                p(v-for="(c, index) in column") ({{index + 1}}) {{ c }}
              li.column-list-style(v-else="typeof(column) !== Array") {{ column }}
      p.paragraph-style(align='right') 以上
      p.paragraph-style(align='left') 2018年5月27日制定
</template>


<script lang="ts">
import { Component, Vue, Emit, Prop } from 'vue-property-decorator';
import TermsBlock from '../molecules/TermsBlock.vue';
import TopMenu from '../molecules/TopMenu.vue';

@Component({
  components: {
    TopMenu,
    TermsBlock,
  },
})
export default class TermsTemplate extends Vue {
  private blocks: any = [
      {
        title: '第1条（規約への同意）',
        columns: [
          'ユーザーは、本規約の定めに従って本サービスを利用しなければなりません。ユーザーは、本規約に有効かつ取消不能な同意をしないかぎり本サービスを利用できません。',
          'ユーザーが未成年者である場合は、親権者など法定代理人の同意を得たうえで本サービスを利用してください。',
          'ユーザーは、本サービスを実際に利用することによって本規約に有効かつ取消不能な同意をしたものとみなされます。',
        ],
      },
      {
        title: '第2条（本サービスの提供、無保証、変更、中止）',
        columns: [
          '登録希望者が運営者の定める方法によって利用登録を申請し，運営者がこれを承認することによって，利用登録が完了するものとします。',
          '運営者は，利用登録の申請者に以下の事由があると判断した場合，利用登録の申請を承認しないことがあり，その理由については一切の開示義務を負わないものとします。',
          [
            '利用登録の申請に際して虚偽の事項を届け出た場合',
            '本規約に違反したことがある者からの申請である場合',
            'その他，運営者が利用登録を相当でないと判断した場合',
          ],
          '運営者は、本サービスの提供を受けることができるユーザーを、会員登録の有無、年齢、ご本人確認の有無、その他、運営者が必要と判断する条件を満たしたお客様に限定することができるものとします。',
          '運営者は、本サービスに運営者または第三者の広告を掲載することができるものとします。',
          '運営者は、本サービス（本サービスを通じてアクセスすることのできるコンテンツを含みます。）に事実上または法律上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、権利侵害などを含みますが、これらに限りません。）がないことを保証しておりません。運営者は、ユーザーに対して、かかる瑕疵を除去して本サービスを提供する義務を負いません。',
          '運営者は、ユーザーが本規約に違反して本サービスを利用していると認めた場合、運営者が必要かつ適切と判断する措置を講じます。ただし、運営者は、ユーザーおよび第三者に対して、ユーザーその他の者が本規約に違反しないことを保証するものではありません。また、運営者は、ユーザーおよび第三者に対して、かかる違反を防止または是正する義務を負いません。',
        ],
      },
      {
        title: '第3条（情報・コンテンツの取り扱い）',
        columns: [
          'ユーザーは、本サービスを会員登録して利用する場合、その利用に際して登録するニックネーム、メールアドレス及びパスワード（以下総称して「会員登録情報」といいます。）を不正に利用されないよう自らの責任で厳重に管理しなければなりません。運営者は、本サービス上で会員登録情報を利用して行なわれた一切の行為を、当該会員登録情報を登録したユーザーご本人の行為とみなすことができます。',
          'ユーザーの個人情報の取扱いに関しては、本規約のほか、運営者のプライバシーポリシーに従います。',
          '本規約において、「コンテンツ」とは、文章、画像、動画、その他の情報のことをいい、「本コンテンツ」とは、本サービスを通じてアクセスすることができるコンテンツのことをいい、「投稿コンテンツ」とは、ユーザーが本サービスに投稿、送信、アップロードするなどして運営者の管理するサーバに保存させたコンテンツのことをいい、「公開投稿コンテンツ」とは、本サービスにおいて、他のユーザーによる閲覧またはアクセスが可能な投稿コンテンツのことをいいます。',
          'ユーザーは、他のユーザーの所有するアカウントへの投稿コンテンツに対してコンテンツを投稿した場合、著作権は投稿コンテンツが表示されるページのアカウント所有者へと譲渡されることとします。そのため、ユーザーは自らの所有するアカウントのページ内における投稿コンテンツの削除、変更等自らの判断で行うことができるものとします。',
          'ユーザーは、本コンテンツを、本サービスが当然に予定している利用態様を超えて利用（複製、送信、転載、改変などの行為を含みます。）してはなりません。ただし、運用者および本コンテンツの権利者から事前の承諾を受けた場合はこの限りではありません。',
          '運営者は、法令または本規約の遵守状況などを確認する必要がある場合、投稿コンテンツの内容を確認することができます。ただし、運営者はかかる確認を行なう義務を負うものではありません。',
        ],
      },
      {
        title: '第4条（利用料金および支払方法）',
        columns: [
          'ユーザーは，本サービスを原則無償で利用できるものとします。ユーザーは、本サービスを利用するにあたり、必要なパーソナルコンピュータ、携帯電話機、通信機器、オペレーションシステム、通信手段および電力などについては、ユーザーの費用と責任で用意しなければなりません。運営者が利用料金を別途定めた場合についてはこの限りではありません。有償の機能等を提供した場合は本ウェブサイトに表示する利用料金を，運営者が指定する方法により支払うものとします。',
        ],
      },
      {
        title: '第5条（禁止事項）',
        columns: [
          'ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。',
          [
            '法令、裁判所の判決、決定もしくは命令、または法令上拘束力のある行政措置に違反する行為。',
            '公の秩序または善良の風俗を害するおそれのある行為。',
            '運営者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為',
            '運営者のサービスの運営を妨害するおそれのある行為',
            '許諾なく第三者の個人情報、登録情報、利用履歴情報などを収集、開示または提供する行為。',
            '運営者または第三者の権利（著作権、商標権、特許権等の知的財産権、名誉権、プライバシー権、その他法令上または契約上の権利を広く含みます。）を侵害する行為。',
            '運営者のサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為',
            '運営者の事前の同意を得ずに営利を目的として本サービスを利用する行為、異性との出会い、交際等を希望することが主な目的と認められる行為、その他本サービスが予定している利用目的と異なる目的で本サービスを利用する行為。',
            '宗教活動または宗教団体への勧誘行為。',
            '上記1から9のいずれかに該当する行為を援助または助長する行為。',
            'その他，運営者が不適切と判断する行為',
          ],
        ],
      },
      {
        title: '第6条（本サービスの提供の停止等）',
        columns: [
          '運営者は，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。',
          [
            '本サービスにかかるコンピュータシステムの保守点検または更新を行う場合',
            '地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合',
            'コンピュータまたは通信回線等が事故により停止した場合',
            'その他，運営者が本サービスの提供が困難と判断した場合',
          ],
          '運営者は，本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害について，理由を問わず一切の責任を負わないものとします。',
        ],
      },
      {
        title: '第7条（利用制限および登録抹消）',
        columns: [
          '運営者は，以下の場合には，事前の通知なく，ユーザーに対して，本サービスの全部もしくは一部の利用を制限し，またはユーザーとしての登録を抹消することができるものとします。',
          [
            '本規約のいずれかの条項に違反した場合',
            '登録事項に虚偽の事実があることが判明した場合',
            'その他，運営者が本サービスの利用を適当でないと判断した場合',
          ],
          '運営者は，本条に基づき運営者が行った行為によりユーザーに生じた損害について，一切の責任を負いません。',
        ],
      },
      {
        title: '第8条（免責事項）',
        columns: [
          '運営者は、本サービスに起因してユーザーに生じたあらゆる損害について一切の責任を負いません。ただし、本サービスに関する運営者とユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合、本項の免責規定は適用されません。',
          '前項ただし書に定める場合であっても、運営者は、運営者の過失（重過失を除きます。以下、本項において同じ。）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（運営者またはユーザーが損害発生につき予見し、または予見し得た場合を含みます。）について一切の責任を負いません。また、運営者の過失による債務不履行または不法行為によりユーザーに生じた損害の賠償は、ユーザーが本サービスの利用に際して当該損害が発生した月に費消した回線費用の額を上限とします。',
        ],
      },
      {
        title: '第9条（サービス内容の変更等）',
        columns: [
          '運営者は，ユーザーに通知することなく，本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし，これによってユーザーに生じた損害について一切の責任を負いません。',
        ],
      },
      {
        title: '第10条（利用規約の変更）',
        columns: [
          '運営者は，必要と判断した場合には，ユーザーに通知することなくいつでも本規約を変更することができるものとします。',
        ],
      },
      {
        title: '第11条（通知または連絡）',
        columns: [
          '本サービスに関する運営者からユーザーへの通知または連絡は、運営者が運営するウェブサイト内の適宜の場所への掲示その他、運営者が適当と判断する方法により行ないます。',
          '本サービスに関するユーザーから運営者への通知または連絡は、運営者が運営するウェブサイト内の適宜の場所に設置するお問い合わせフォームの送信または運営者が別途指定する方法により行っていただきます。',
        ],
      },
      {
        title: '第12条（権利義務の譲渡の禁止）',
        columns: [
          'ユーザーは，運営者の書面による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。',
        ],
      },
      {
        title: '第13条（準拠法・裁判管轄）',
        columns: [
          '本規約は日本語を正文とし、その準拠法は日本法とします。本サービスに起因または関連してユーザーと運営者との間に生じた紛争については東京地方裁判所または東京簡易裁判所を第一審の専属的合意管轄裁判所とします。かかる管轄裁判所で得られた勝訴判決は、いずれの国の裁判所においても執行可能とします。',
        ],
      },
  ];
}
</script>

<style lang='stylus' scoped>
.terms-title-style
  margin 16px 4px
  padding 8px
  border-bottom solid 1px #d9d9d9

.paragraph-style
  padding 10px 24px

.preface-style
  padding 10px 4px

.column-list-style
  padding 16px 0px !important
</style>